import 'package:flutter/material.dart';
import 'package:persistent_bottom_nav_bar/persistent-tab-view.dart';
import 'package:project_new_style/AppBars/normalAppBar.dart';
import 'package:project_new_style/Components/blogPostElement.dart';
import 'package:project_new_style/Components/customErrorWidget.dart';
import 'package:project_new_style/Components/customIndicator.dart';
import 'package:project_new_style/Functions/moreFunctions.dart';
import 'package:project_new_style/Pages/More/blogPost.dart';
import 'package:project_new_style/Setting/numbers.dart';
import 'package:project_new_style/Setting/strings.dart';
import 'package:project_new_style/Styles/textStyles.dart';
import 'package:project_new_style/providers/MorePageProviders/blogProvider.dart';
import 'package:provider/provider.dart';

class Blog extends StatefulWidget {
  final int postId;
  final int _pageIndex;

  Blog(this._pageIndex, {this.postId});

  @override
  _BlogState createState() => _BlogState();
}

class _BlogState extends State<Blog> {
  // List<Map<String, Object>> staticData = [
  //   {
  //     "id": 7,
  //     "title": "مطلب ۱",
  //     "content":
  //         "این روزها با افزایش هزینه‌های زندگی همه‌ی ما باید به فکر افزایش درآمد خود نیز باشیم. اما افزایش نرخ پیشنهادی برای انجام پروژه‌ها همیشه یکی از ترس‌های بزرگ فریلنسرها بود است. مخصوصا در اوایل فعالیت به عنوان فریلنسر، اغلب ترجیح می‌دهند تا مدت‌ها با یک قیمت ثابت کار می‌کنند. اما اگر با خودمان رو راست باشیم افزایش مخارج زندگی تعارف‌بردار نیست و باید با این مساله کنار بیایید که بعد از مدتی نرخ پیشنهادی خود برای انجام پروژه‌ها را افزایش دهید. علاوه بر این موارد شما می‌توانید از پیشنهادهای زیر هم به عنوان یکی از دلایل افزایش قیمت پیشنهادی خود استفاده کنید.\r\n\r\nنمونه کار‌های حرفه‌ای‌تر\r\n\r\nسعی کنید نمونه کارهای خود را به روز کنید و از نمونه کارهای حرفه‌ای‌تری استفاده کنید. اگر هم نمونه کار ندارید حتما سعی کنید قبل از شروع ازسال پیشنهاد برای انجام پروژه‌ها ابتدا یک پروژه‌ی فرضی برای خود در نظر بگیرید و بعد از انجام، از خروجی به عنوان نمونه کار خود استفاده کنید. حتی می‌توانید در مسابقه‌های پونیشا هم به صورت رایگان شرکت کنید و علاوه بر اینکه شانس برنده شدن داشته باشید از طرح پیشنهادی خود در پروفایلتان به عنوان نمونه‌ کار هم استفاده کنید.\r\n\r\nیادگیری مهارت‌های بیشتر\r\n\r\nشما با یادگیری نرم‌افزارهای مرتبط با مهارت خود سطح و کیفیت کاری خود را افزایش می‌دهید پس می‌توانید از این مورد هم به عنوان یکی از دلایل مهم افزایش قیمت خود برای کارفرماها استفاده کنید.\r\n\r\nپشتیبانی خدمات\r\n\r\nشما می‌توانید یکی از دلایل افزایش قیمت خود به کارفرماها را امکان پشتیبانی صحیح از پروژه عنوان کنید. سعی کنید در این مورد یک چارچوب صحیح و مشخص داشته باشید تا کارفرما متوجه استراتژی شما شود.\r\nنترسید\r\n\r\nاز قیمت کمتر فریلنسرهای دیگر برای انجام پروژه‌ها نترسید. در نهایت شما با افزایش منطقی نرخ خود به فرهنگ‌سازی این مساله در فریلنسینگ کمک خواهید کرد. برای تغییر در مقیاس بزرگ فقط کافی است از خودمان شروع کنیم.\r\n\r\nدر نهایت فراموش نکنید که نرخ منطقیِ هر خدمت باکیفیتی دیر یا زود مشخص خواهد شد. پس نگران نباشید و با قیمت مورد نظر خود کار کنید و به این مساله توجه کنید که افزایش قیمت همراه با افزایش کیفیت انجام پروژه‌ها می‌تواند مسیر شما را برای بالا بردن نرخ پیشنهادی‌تان هموارتر کند.\r\n\r\nپیشنهاد شما برای نحوه‌ی افزایش قیمت خدمات چیست؟",
  //     "update_time": "1399-09-10T07:45:20.757194+00:00",
  //     "create_time": "1399-09-10T07:45:20.757213+00:00",
  //     "image":
  //         "http://138.201.6.240:8001/media/blog_photos/increase-virgool.jpg",
  //     "owner": null
  //   },
  //   {
  //     "id": 6,
  //     "title": "مطلب ۲",
  //     "content":
  //         "مهم‌ترین دغدغه‌ در طراحی لوگو استفاده از بهترین رنگ و المان برای بازنمایی مفاهیم مورد نظر سفار‌ش‌دهنده است. یکی از مسابقه‌های موفق برگزار شده در پونیشا مسابقه طراحی لوگوی خانه امید بوده که به تازگی با انتخاب طرح برنده به پایان رسیده است. در این پست خلاصه‌ای از گفتگوی ما با برگزار کننده و برنده این مسابقه را خواهید خواند که در نهایت باعث ایجاد یک تعامل سازنده در مسابقه و موفقیت آن شد. نکاتی که اطلاع از آن می‌تواند برای همه‌ی فریلنسرها و کارفرماها مفید باشد.\r\n\r\nحمیده حبیبی برگزار کننده مسابقه در مورد تجربه‌ی ایجاد مسابقه در پونیشا به ما اینطور گفت: «ایجاد کردن مسابقه بسیار راحت بود و من تصور نمی‌کردم با این تعداد زیاد طرح روبرو شویم. البته این تعداد زیاد طرح از طرفی مارو با تنوع زیادی از ایده‌ها روبرو کرد و از طرفی مدیریت طرح‌ها و غربالگری رو سخت‌تر کرد. به طور کلی مهم‌ترین مزیت ایجاد مسابقه نسبت به پروژه در این است که زمانی که شما ذهنیت کاملی در مورد طرح نهایی ندارید، با ایجاد مسابقه و روبرو شدن با تنوع ایده‌های طراحان، در نهایت می‌توانید به بهترین طرح که مورد نظر شماست برسید. تعامل با تعداد زیادی طراح در مسابقه این فرصت را به شما می‌دهد که بهترین نتیجه را بگیرید.»\r\n«خانه امید» یک مرکز مردم نهاد نگهداری از کودکان بی‌سرپرست است که در حال حاضر در دو منزل مسکونی و در مجموع ۱۱۸ دختر و پسر با رده‌ی سنی ۲ تا ۱۴ ساله را نگهداری می‌کند. خانه امید تلاش می‌کند با ارائه‌ی فضایی امن و حمایت‌های روانی مانند مشاوره برای کودکانی که به دلایل مختلف والدین و سرپرست خود را از دست داده‌اند، محیطی گرم و صمیمی مانند خانه فراهم کند تا این افراد بتوانند در آرامشی که مددکاران فراهم می‌کنند، امنیت را تجربه کنند. از اهداف اصلی خانه امید کمک به توانمندسازی و فراهم سازی زمینه‌های تحصیل این کودکان است که در همین راستا تا کلاس ششم می‌توانند در همان محل به مدرسه بروند.\r\n\r\nخانم حبیبی نماینده خانه امید از تجربه‌ی تعامل و همکاری با برنده‌ی این مسابقه گفتند:\r\n\r\n«آقای شاهسون طراح بسیار حرفه‌ای هستند. در ابتدای مسابقه طرحی فرستاده بودند ولی بعد از مدتی طرح دیگری ارسال کردند که مواردی که ما در نظر داشتیم را شامل می‌شد. ایشان مشخصا زمان زیادی روی ایده‌پردازی برای این لوگو گذاشتند و بخاطر همین به طرح ایشان به عنوان برنده انتخاب شد. با صبر و حوصله تغییرات جزئی‌ای در طرح اعمال کردند و در نهایت همه‌ی فایل‌های مورد نیاز را در اختیار ما قرار دادند و حتی لطف کردند برای ما پاکت نامه و سربرگ هم طراحی کردند. تجربه‌ی همکاری با ایشان به عنوان فریلنسری حرفه‌ای بسیار لذت‌بخش بود.»\r\nسعید شاهسون برنده‌ی مسابقه طراحی لوگوی خانه امید از سال ۹۶ در پونیشا عضو است. تحصیلات او در زمینه‌ی گرافیک است و بیش از ۷ سال است که تجربه‌ی کار در حیطه‌ی فریلنسینگ را دارد. او به فریلنسینگ مانند یک چالش نگاه می‌کند تا خود را در رقابتی همه جانبه از نظر ارائه کار خوب و حرفه ای، ارتباطات و مارکتینگ قرار دهد.\r\nاو در مورد روند طراحی لوگوی «خانه امید» ‌به ما اینطور گفت که:\r\n\r\n«در مورد این لوگو بعد از اینکه موضوع و جزئیات این مسابقه رو کامل مطالعه کردم متوجه شدم که بعضی از عناصری که می‌باید در این لوگو لحاظ بشه شکل بصری مشخصی نداره. به عبارت دیگه خانه به شکل‌های متنوعی میشه طراحی بشه ولی امید شکل خاصی نداره و بر اساس تصور هر فرد میتونه اشکال مختلفی داشته باشه. بعد از بررسی و تحقیق‌هایی که انجام دادم تصمیم گرفتم از المان نور برای بیان امید استفاده کنم. همینطور برای اینکه سفارش دهنده می‌خواست مفهوم حمایت هم در لوگو نشان داده بشه از المان دست استفاده کردم و با توجه به سن پایین کودکان خانه امید که می‌شه گفت مخاطبان اصلی این لوگو بودن باید کار به نحوی اجرا می‌شد که کودکانه به نظر می‌رسید برای این کار هم نقاشی کودکانه رو انتخاب کردم و طرح بر پایه یک نقاشی کودکانه اجرا شد ولی به خاطر کارکردها و قواعد طراحی لوگو نقاشی رو به شکل مرتب‌تر و منظم طراحی شد.»\r\nما در پونیشا به عنوان اسپانسر این مسابقه برای خانه امید و سعید شاهسون، برنده مسابقه، آرزوی موفقیت می‌کنیم. و خوشحالیم از اینکه این مسابقه با موفقیت به پایان رسیده و تجربه‌ی خوبی برای برگزارکننده و فریلنسر برنده داشته است.\r\n\r\nایجاد مسابقه در پونیشا روند ساده‌ای دارد. اگر ایده یا پروژه‌ای در زمینه‌ی طراحی دارید می‌توانید با ارائه‌ی توضیحات مربوط به آن و ایجاد مسابقه فرصت تعامل با تعداد زیادی طراح را داشته باشید.",
  //     "update_time": "1399-09-10T07:44:34.200313+00:00",
  //     "create_time": "1399-09-10T07:44:34.200339+00:00",
  //     "image": "http://138.201.6.240:8001/media/blog_photos/omid4.jpg",
  //     "owner": null
  //   },
  //   {
  //     "id": 5,
  //     "title": "مطلب ۳",
  //     "content":
  //         "در چند سال اخیر فریلنسینگ در ایران همگام با تغییرات جهانی رشد خیلی خوبی داشته و حالا تقریبا در همه‌ی مهارت‌ها فریلنسرهای متخصص داخل کشور داریم. اگر شما کارفرمایی خارج از ایران هستید، یا کارفرمایی خارج از ایران می‌شناسید که به دنبال نیروی متخصص است می‌توانید از طریق پونیشا با فریلنسرهای داخل ایران کار کنید. شما می‌توانید از طریق پی‌پال، واریز به حساب بانکی، یا حتی بیت کوین حساب خود را در پونیشا شارژ کنید و با نیروهای متخصص همکاری داشته باشید.\r\n\r\nمرحله‌ی اول: ثبت درخواست\r\n\r\nاز طریق فرم داخل این صفحه درخواست خود را برای ما ارسال کنید تا در اسرع وقت با شما تماس بگیریم.\r\n\r\nمرحله‌ی دوم: انتقال وجه\r\n\r\nپس از مشخص شدن نوع ارز، روش انتقال و ارزش ریالی انتقال وجه را انجام دهید تا حساب شما در پونیشا شارژ شود.\r\n\r\nمرحله‌ی سوم: ادامه کار با فریلنسر\r\n\r\nپس از شارژ حساب کاربری خود می‌توانید فعالیت خود را در پونیشا ادامه دهید، پروژه و مسابقه ایجاد کنید و از طریق قسمت گفتگو با فریلنسرها در ارتباط  باشید و از بین پیشنهادهای دریافتی برای انجام پروژه‌، با توجه به رزومه، نمونه کار و قیمت، فریلنسر یا فریلنسرهای مورد نظر خود را برای انجام کارانتخاب کنید. \r\n\r\nبا اطمینان با فریلنسرهای داخل ایران کار کنید:\r\n\r\nاز طریق پرداخت امن پونیشا با اطمینان با فریلنسرهای داخل ایران کار کنید، شما تا قبل از تحویل پروژه و اعلام رضایت از نتیجه کار هزینه‌ای به فریلنسر پرداخت نمی‌کنید،‌ بلکه این مبلغ در حساب شما قفل می‌شود تا زمانی که پس از تحویل کار شما این مبلغ را برای فریلنسر آزاد کنید.\r\n\r\nبرای کسب اطلاعات بیشتر و دریافت کد تخفیف به اینستاگرام پونیشا سر بزنید و با ما در ارتباط باشید",
  //     "update_time": "1399-09-10T07:43:39.022750+00:00",
  //     "create_time": "1399-09-10T07:43:39.022775+00:00",
  //     "image": "http://138.201.6.240:8001/media/blog_photos/abroad.jpg",
  //     "owner": null
  //   },
  //   {
  //     "id": 4,
  //     "title": "مطلب ۴",
  //     "content":
  //         "اگر تا به الان تجربه‌ی دورکاری و برون سپاری پروژه‌ها را ندارید احتمالا برایتان جای تعجب است که چطور می‌توان از راه دور و بدون حتی جلسه‌ای حضوری پروژه و کاری با موفقیت انجام شود؟ خوب است بدانید که براساس آمارهای پیش بینی شده در چند سال اخیر فقط در آمریکا تا سال ۲۰۲۵ بیشتر از ۶۰ درصد شغل‌ها از طریق دورکاری و فریلنسینگ انجام خواهد شد. این در حالی است که در چند ماه اخیر با توجه به همه گیری بیماری کرونا و لزوم کار کردن از خانه و راه دور تعداد پروژه‌های برون سپاری شده حداقل دو برابر شده است و همچنان با شتاب بیشتری روند صعودی خواهد داشت. در همین راستا در این مدت ۸۹ درصد از کارفرماهایی که مجبور به پیشبرد پروژه از راه دور شده‌اند، ادعا کرده‌اند که زمان انجام پروژه‌ها از طریق تماس تصویری و دورکاری کاهش پیدا کرده است. این آمار تا حد زیادی قابل پیش بینی است اگر بدانید که کارمندان زمان بسیار زیادی را در مسیر رفت و آمد به محل کار هدر می‌دهند و از طرفی همین موضوع باعث خستگی و کاهش بازده کاری آنها می‌شود. همچنین کار کردن از خانه و به دور بودن از استرس‌ها و تنش‌های دنیای بیرون می‌تواند روی روحیه‌ی کارمندان اثر مثبتی داشته باشد.\r\n\r\nاگر به عنوان یک صاحب کسب و کار هنوز به دورکاری به عنوان یک فرصت نگاه نکرده‌اید در ادامه چند پیشنهاد برای نحوه‌ی شروع دورکاری کارمندان و نیروی متخصص شما داریم:\r\n\r\nلیست کارمندان و وظایف آن‌ها را بررسی کنید و ببینید امکان انجام کدام یک از کارها از راه دور وجود ندارد و حتما نیاز به نیرویی در شرکت می‌باشد. سعی کنید در انتخاب سخت‌گیر باشید و فقط بخاطر بایگانی اسناد و مدارک و یا هماهنگی جلسات و تیم‌ها نیروی کاری را به دفتر نکشانید. بعد از اینکه کارمندان را به دو دسته تقسیم کردید، باید به سراغ لیست کارهایی بروید که کارمندان دورکار باید انجام دهند و ابزار لازم برای انجام آن در خانه را برایشان تا حد امکان فراهم کنید. فضای ابری مناسب برای ذخیره‌سازی اسناد و گزارش‌ها و تهیه‌ی اشتراک برای استفاده از ابزارهای ویدئو کنفرانس و… حتی می‌توانید در صورت امکان ترتیبی بدهید که کارمندان سیستم و لپ تاپی که در شرکت با آن کار می‌کنند را در خانه هم استفاده کنند تا دسترسی به سخت افزار مورد نیاز برای انجام کارها نیز داشته باشند.\r\n\r\nدر نهایت باید با کارمندان خود در این مورد صحبت کنید و از آن‌ها بخواهید نظر خود را درباره‌ی دورکاری بیان کنند. حتی می‌توانید برای شروع دورکاری یک ماه آزمایشی را در نظر بگیرید تا بعد تصمیم نهایی را با توجه به بازده و روند موفق انجام کارها در این مدت، اتخاذ کنید.\r\n\r\nپیشنهاد شما برای شروع دورکاری چیست؟",
  //     "update_time": "1399-09-10T07:43:00.357080+00:00",
  //     "create_time": "1399-09-10T07:43:00.357098+00:00",
  //     "image": "http://138.201.6.240:8001/media/blog_photos/remote-work.jpg",
  //     "owner": null
  //   },
  //   {
  //     "id": 3,
  //     "title": "مطلب ۵",
  //     "content":
  //         "همه‌ی ما می‌دانیم که فریلنسینگ به تنهایی یک شغل نیست و تنها یک سبک زندگی است. اگر شما هنوز تخصصی ندارید که از آن کسب درآمد کنید می‌توانید از مهارت‌هایی شروع کنید که بیشترین پروژه را دارند و با انجام آن‌ها علاوه بر درآمد انگیزه‌ی بیشتری برای ادامه دادن در فریلنسینگ داشته باشید.\r\n\r\nبرای شروع با آموختن این ۴ مهارت می‌توانید به عنوان یک فریلنسر شروع به کار کنید و از تخصص خود کسب درآمد کنید:\r\n\r\n۱. ترجمه، بالاخره این همه زبان خواندن باید به دردی بخورد\r\n\r\nترجمه هنوز هم یکی از مهارت‌های پرطرفدار در فریلنسینگ است. شما می‌توانید با افزایش دانش خود از زبان فارسی و یک زبان دیگر مانند انگلیسی، عربی، اسپانیایی،‌ ترکی و… در کنار یاد گرفتن تکنیک‌های ترجمه، به عنوان یک فریلنسر از تجرمه متون عمومی و تخصصی کسب درآمد کنید.\r\n\r\n۲. تولید محتوا، پادشاه باشید\r\n\r\nاین روزها محتوا قلب اصلی هر کسب و کار و بیزینسی است. شرکت‌ها و استارتاپ‌ها و حتی خیلی از اینفلوئنسرها محتوای شبکه‌های اجتماعی خود را برون‌سپاری می‌کنند تا یک فریلنسر با دیدگاه خلاق‌تر و بهتری محتوای اختصاصی و مرتبط برایشان تولید کند. پس اگر شما آدم خلاقی باشید و به نوشتن، دنیای هیجان‌انگیز کلمات و خلق محتوا علاقه داشته باشید می‌توانید با انجام پروژه‌های تولید محتوا به عنوان یک فریلنسر درآمد داشته باشید.\r\n\r\n۳. طراحی گرافیک، دنیای رنگ‌ها و اشکال\r\n\r\nتنوع پروژه‌های این مهارت آنقدر زیاد است که اگر به عنوان یک تازه کار هم شروع به کار کنید در مسیر یادگیری و حرفه‌ای شدن با انجام پروژه‌ها می‌توانید از آن درآمد هم کسب کنید. از طراحی لوگو تا طراحی ست اداری، تصویرسازی، طراحی اپلیکیشن و سایت، طراحی بسته بندی و طراحی داخلی و نما فقط چند نمونه از تنوع پروژه‌های مرتبط با این مهارت است. برای شروع می‌توانید یک حوزه را انتخاب کنید تا با انجام پروژه‌ها و کسب تجربه خود را برای یادگیری نرم‌افزارها و مهارت‌های بیشتر آماده کنید.\r\n\r\n۴. ادمین شبکه‌های اجتماعی، کمی چالش\r\n\r\nتقریبا همه‌ی ما چند ساعت از شبانه روز خود را مشغول اسکرول و چک کردن شبکه‌های اجتماعی هستیم. با ترکیبی از سه مهارت قبلی، کمی خلاقیت و خوره‌ی شبکه‌های اجتماعی بودن می‌توانید از همین راه هم به درآمد برسید! \r\n\r\nرمز موفقیت، یادگیری و آنالیز همزمان\r\n\r\nبه عنوان یک فریلنسر شاید بزرگ‌ترین چالش برای شما مدیریت و برنامه ریزی کارهاست. اینکه بدانید یادگیری مهارت‌های بیشتر و به کار گیری آنها در انجام پروژه‌ها ارتباط مستقیمی با افزایش درآمد و موفقیت شما دارد. پس فراموش نکنید در فریلنسینگ یادگیری نقطه پایانی ندارد.\r\n\r\nآزادی فریلنسینگ به شما این امکان را می‌دهد که در حین انجام پروژه‌ها، با یادگیری مهارت‌های جدید درآمد خود را نیز افزایش دهید و با آنالیز کار خود همیشه یک قدم از اشتباهاتتان جلوتر باشید.\r\n\r\nبرای شروع کسب درآمد از فریلنسینگ آماده‌اید؟ به پونیشا سر بزنید",
  //     "update_time": "1399-09-10T07:42:00.218785+00:00",
  //     "create_time": "1399-09-10T07:42:00.218803+00:00",
  //     "image": "http://138.201.6.240:8001/media/blog_photos/4skills-blog.jpg",
  //     "owner": null
  //   },
  //   {
  //     "id": 2,
  //     "title": "مطلب ۶",
  //     "content":
  //         "اغلب ما که از شطرنج سر در نمی‌آوریم فکر می‌کنیم بازی حوصله سر بری باشد. اما این روزها مینی سریال The Queen’s Gambit با ارائه‌ی یک داستان جذاب توانسته توجه‌ها را به شطرنج جلب کند. این سریال خیلی زود جزو محبوب‌ترین سریال‌های نتفلیکس شده است. داستان دختری نابغه که در یتیم‌خانه بزرگ می‌شود و تنها علاقه‌اش صفحه شطرنج و مهره‌های سفید و سیاه آن است. از آنجایی که به قهرمانان شطرنج لقب استاد بزرگ می‌دهند و از آنها به عنوان نابغه یاد می‌کنند پس باید دانست که شطرنج بیش از یک بازی است. در پس این صفحه‌ی سیاه و سفید آن، هر خانه و هر مهره‌ دارای ارزش خاص خود است و برنده کسی است که برای مواجهه با بیشترین احتمالات آماده باشد، درست شبیه زندگی هر روزه‌ی ما. اما ما برای موفقیت چطور باید مثل برنده‌ها فکر کنیم؟\r\n\r\nحرکت هدفمند\r\n\r\nبرای هر حرکت در کسب و کار خود هدف و دلیلی موجه داشته باشید. همیشه حواستان به حرکت رقیب و تغییرات بازار باشد و متناسب با هر تغییری برنامه داشته باشید. همیشه به احتمالات بیشتر فکر کنید تا برای تغییرات ناگهانی آماده باشید.\r\n\r\nساماندهی مهره‌ها\r\n\r\nاز منابع و نیروهای خود به بهترین نحو استفاده کنید. سعی کنید نقاط قوت و ضعف کسب و کار خود را بشناسید و برای گسترش و توسعه هیچ وقت عجله نکنید. مهم پیشروی با کمترین خطاست و سریع‌تر رفتن هیچ وقت نباید هدف نهایی باشد.\r\n\r\nحفظ ارزش تمام مهره‌ها\r\n\r\nبا اینکه در شطرنج هر مهره‌ای ارزش خود را دارد اما در روند بازی یک سرباز هم می‌تواند تاثیرگذار باشد و باید برای حرکت آن استراتژی داشت. برای رسیدن به موفقیت از تمام نیروی خود استفاده کنید. مهارت‌ها و نیروی انسانی در تیم شما همه‌ دارای ارزش هستند. سعی کنید از بهترین پتانسل آنها برای پیشبرد اهداف خود استفاده کنید.\r\n\r\nهدایت مهره‌ها\r\n\r\nدر شطرنج برای مات کردن حریف باید تمام مهره‌ها در راستای یک هدف واحد حرکت کنند. در کسب و کار هم شما باید بتوانید اعضای تیم و منابع خود را همراستا با هدف نهایی خود مدیریت کنید. برای این منظور باید نقشه‌ی پیشروی داشته باشید و بدانید هر فرد چه نقشی به عهده خواهد داشت.\r\nمثل برنده‌ها فکر کن\r\n\r\nمجموع همه‌ی حرکت‌ها در شطرنج شما را برنده می‌کند همانطور که برای موفق شدن در کسب و کار و زندگی باید از همان ابتدا برنامه داشت و در مسیر رسیدن به آن تلاش کرد. نمی‌توان گفت بدون استراتژی و برنامه‌ریزی شبانه روز می‌توان به موفقیت رسید. زمانی می‌توانید در مسیر موفقیت قدم بردارید که نقشه‌ی آنرا از قبل ترسیم کرده باشید.\r\n\r\nشکست مقدمه پیروزی\r\n\r\nاز شکست نترسید و هیچ وقت خود را بابت آن سرزنش نکنید. به جای آن برای دوباره شروع کردن خود را آماده کنید چون بازی هنوز ادامه دارد. سعی کنید با فراهم کردن یک فرهنگ سازمانی درست از اعضای تیم خود نیز همین را بخواهید. مساله‌ی مهم ناامید نشدن است. مهم‌ترین ویژگی شطرنج‌بازان موفق خسته نشدن از تلاش دوباره است. از شکست‌ها می‌توان درس‌های بیشتری گرفت تا پیروزی‌ها. پس همیشه سعی کنید کار خود را آنالیز کرده و با افزایش تمرکز روی نقاط قوت و بهبود نقاط ضعف با برنامه‌ریزی بهتر دوباره شروع کنید.\r\n\r\nبرای برونسپاری کارهای خود و عملی کردن پروژه‌هایتان می‌توانید در پونیشا نیروی متخصص پیدا کنید و از طریق ایجاد مسابقه یا پروژه با آنها کار کنید. اگر هم مهارتی دارید می‌توانید به عنوان یک فریلنسر در پونیشا فعالیت کنید و با انجام پروژه‌ها، از مهارت و تخصص خود کسب درآمد داشته باشید. همین امروز به پونیشا سر بزنید. برای اطلاع از اخبار پونیشا و کد تخفیف‌ها می‌توانید پونیشا را در اینستاگرام دنبال کنید",
  //     "update_time": "1399-09-10T07:40:41.327948+00:00",
  //     "create_time": "1399-09-10T07:40:41.327967+00:00",
  //     "image": "http://138.201.6.240:8001/media/blog_photos/chess.jpg",
  //     "owner": null
  //   },
  //   {
  //     "id": 7,
  //     "title": "مطلب ۷",
  //     "content":
  //         "این روزها با افزایش هزینه‌های زندگی همه‌ی ما باید به فکر افزایش درآمد خود نیز باشیم. اما افزایش نرخ پیشنهادی برای انجام پروژه‌ها همیشه یکی از ترس‌های بزرگ فریلنسرها بود است. مخصوصا در اوایل فعالیت به عنوان فریلنسر، اغلب ترجیح می‌دهند تا مدت‌ها با یک قیمت ثابت کار می‌کنند. اما اگر با خودمان رو راست باشیم افزایش مخارج زندگی تعارف‌بردار نیست و باید با این مساله کنار بیایید که بعد از مدتی نرخ پیشنهادی خود برای انجام پروژه‌ها را افزایش دهید. علاوه بر این موارد شما می‌توانید از پیشنهادهای زیر هم به عنوان یکی از دلایل افزایش قیمت پیشنهادی خود استفاده کنید.\r\n\r\nنمونه کار‌های حرفه‌ای‌تر\r\n\r\nسعی کنید نمونه کارهای خود را به روز کنید و از نمونه کارهای حرفه‌ای‌تری استفاده کنید. اگر هم نمونه کار ندارید حتما سعی کنید قبل از شروع ازسال پیشنهاد برای انجام پروژه‌ها ابتدا یک پروژه‌ی فرضی برای خود در نظر بگیرید و بعد از انجام، از خروجی به عنوان نمونه کار خود استفاده کنید. حتی می‌توانید در مسابقه‌های پونیشا هم به صورت رایگان شرکت کنید و علاوه بر اینکه شانس برنده شدن داشته باشید از طرح پیشنهادی خود در پروفایلتان به عنوان نمونه‌ کار هم استفاده کنید.\r\n\r\nیادگیری مهارت‌های بیشتر\r\n\r\nشما با یادگیری نرم‌افزارهای مرتبط با مهارت خود سطح و کیفیت کاری خود را افزایش می‌دهید پس می‌توانید از این مورد هم به عنوان یکی از دلایل مهم افزایش قیمت خود برای کارفرماها استفاده کنید.\r\n\r\nپشتیبانی خدمات\r\n\r\nشما می‌توانید یکی از دلایل افزایش قیمت خود به کارفرماها را امکان پشتیبانی صحیح از پروژه عنوان کنید. سعی کنید در این مورد یک چارچوب صحیح و مشخص داشته باشید تا کارفرما متوجه استراتژی شما شود.\r\nنترسید\r\n\r\nاز قیمت کمتر فریلنسرهای دیگر برای انجام پروژه‌ها نترسید. در نهایت شما با افزایش منطقی نرخ خود به فرهنگ‌سازی این مساله در فریلنسینگ کمک خواهید کرد. برای تغییر در مقیاس بزرگ فقط کافی است از خودمان شروع کنیم.\r\n\r\nدر نهایت فراموش نکنید که نرخ منطقیِ هر خدمت باکیفیتی دیر یا زود مشخص خواهد شد. پس نگران نباشید و با قیمت مورد نظر خود کار کنید و به این مساله توجه کنید که افزایش قیمت همراه با افزایش کیفیت انجام پروژه‌ها می‌تواند مسیر شما را برای بالا بردن نرخ پیشنهادی‌تان هموارتر کند.\r\n\r\nپیشنهاد شما برای نحوه‌ی افزایش قیمت خدمات چیست؟",
  //     "update_time": "1399-09-10T07:45:20.757194+00:00",
  //     "create_time": "1399-09-10T07:45:20.757213+00:00",
  //     "image":
  //         "http://138.201.6.240:8001/media/blog_photos/increase-virgool.jpg",
  //     "owner": null
  //   },
  //   {
  //     "id": 6,
  //     "title": "مطلب ۸",
  //     "content":
  //         "مهم‌ترین دغدغه‌ در طراحی لوگو استفاده از بهترین رنگ و المان برای بازنمایی مفاهیم مورد نظر سفار‌ش‌دهنده است. یکی از مسابقه‌های موفق برگزار شده در پونیشا مسابقه طراحی لوگوی خانه امید بوده که به تازگی با انتخاب طرح برنده به پایان رسیده است. در این پست خلاصه‌ای از گفتگوی ما با برگزار کننده و برنده این مسابقه را خواهید خواند که در نهایت باعث ایجاد یک تعامل سازنده در مسابقه و موفقیت آن شد. نکاتی که اطلاع از آن می‌تواند برای همه‌ی فریلنسرها و کارفرماها مفید باشد.\r\n\r\nحمیده حبیبی برگزار کننده مسابقه در مورد تجربه‌ی ایجاد مسابقه در پونیشا به ما اینطور گفت: «ایجاد کردن مسابقه بسیار راحت بود و من تصور نمی‌کردم با این تعداد زیاد طرح روبرو شویم. البته این تعداد زیاد طرح از طرفی مارو با تنوع زیادی از ایده‌ها روبرو کرد و از طرفی مدیریت طرح‌ها و غربالگری رو سخت‌تر کرد. به طور کلی مهم‌ترین مزیت ایجاد مسابقه نسبت به پروژه در این است که زمانی که شما ذهنیت کاملی در مورد طرح نهایی ندارید، با ایجاد مسابقه و روبرو شدن با تنوع ایده‌های طراحان، در نهایت می‌توانید به بهترین طرح که مورد نظر شماست برسید. تعامل با تعداد زیادی طراح در مسابقه این فرصت را به شما می‌دهد که بهترین نتیجه را بگیرید.»\r\n«خانه امید» یک مرکز مردم نهاد نگهداری از کودکان بی‌سرپرست است که در حال حاضر در دو منزل مسکونی و در مجموع ۱۱۸ دختر و پسر با رده‌ی سنی ۲ تا ۱۴ ساله را نگهداری می‌کند. خانه امید تلاش می‌کند با ارائه‌ی فضایی امن و حمایت‌های روانی مانند مشاوره برای کودکانی که به دلایل مختلف والدین و سرپرست خود را از دست داده‌اند، محیطی گرم و صمیمی مانند خانه فراهم کند تا این افراد بتوانند در آرامشی که مددکاران فراهم می‌کنند، امنیت را تجربه کنند. از اهداف اصلی خانه امید کمک به توانمندسازی و فراهم سازی زمینه‌های تحصیل این کودکان است که در همین راستا تا کلاس ششم می‌توانند در همان محل به مدرسه بروند.\r\n\r\nخانم حبیبی نماینده خانه امید از تجربه‌ی تعامل و همکاری با برنده‌ی این مسابقه گفتند:\r\n\r\n«آقای شاهسون طراح بسیار حرفه‌ای هستند. در ابتدای مسابقه طرحی فرستاده بودند ولی بعد از مدتی طرح دیگری ارسال کردند که مواردی که ما در نظر داشتیم را شامل می‌شد. ایشان مشخصا زمان زیادی روی ایده‌پردازی برای این لوگو گذاشتند و بخاطر همین به طرح ایشان به عنوان برنده انتخاب شد. با صبر و حوصله تغییرات جزئی‌ای در طرح اعمال کردند و در نهایت همه‌ی فایل‌های مورد نیاز را در اختیار ما قرار دادند و حتی لطف کردند برای ما پاکت نامه و سربرگ هم طراحی کردند. تجربه‌ی همکاری با ایشان به عنوان فریلنسری حرفه‌ای بسیار لذت‌بخش بود.»\r\nسعید شاهسون برنده‌ی مسابقه طراحی لوگوی خانه امید از سال ۹۶ در پونیشا عضو است. تحصیلات او در زمینه‌ی گرافیک است و بیش از ۷ سال است که تجربه‌ی کار در حیطه‌ی فریلنسینگ را دارد. او به فریلنسینگ مانند یک چالش نگاه می‌کند تا خود را در رقابتی همه جانبه از نظر ارائه کار خوب و حرفه ای، ارتباطات و مارکتینگ قرار دهد.\r\nاو در مورد روند طراحی لوگوی «خانه امید» ‌به ما اینطور گفت که:\r\n\r\n«در مورد این لوگو بعد از اینکه موضوع و جزئیات این مسابقه رو کامل مطالعه کردم متوجه شدم که بعضی از عناصری که می‌باید در این لوگو لحاظ بشه شکل بصری مشخصی نداره. به عبارت دیگه خانه به شکل‌های متنوعی میشه طراحی بشه ولی امید شکل خاصی نداره و بر اساس تصور هر فرد میتونه اشکال مختلفی داشته باشه. بعد از بررسی و تحقیق‌هایی که انجام دادم تصمیم گرفتم از المان نور برای بیان امید استفاده کنم. همینطور برای اینکه سفارش دهنده می‌خواست مفهوم حمایت هم در لوگو نشان داده بشه از المان دست استفاده کردم و با توجه به سن پایین کودکان خانه امید که می‌شه گفت مخاطبان اصلی این لوگو بودن باید کار به نحوی اجرا می‌شد که کودکانه به نظر می‌رسید برای این کار هم نقاشی کودکانه رو انتخاب کردم و طرح بر پایه یک نقاشی کودکانه اجرا شد ولی به خاطر کارکردها و قواعد طراحی لوگو نقاشی رو به شکل مرتب‌تر و منظم طراحی شد.»\r\nما در پونیشا به عنوان اسپانسر این مسابقه برای خانه امید و سعید شاهسون، برنده مسابقه، آرزوی موفقیت می‌کنیم. و خوشحالیم از اینکه این مسابقه با موفقیت به پایان رسیده و تجربه‌ی خوبی برای برگزارکننده و فریلنسر برنده داشته است.\r\n\r\nایجاد مسابقه در پونیشا روند ساده‌ای دارد. اگر ایده یا پروژه‌ای در زمینه‌ی طراحی دارید می‌توانید با ارائه‌ی توضیحات مربوط به آن و ایجاد مسابقه فرصت تعامل با تعداد زیادی طراح را داشته باشید.",
  //     "update_time": "1399-09-10T07:44:34.200313+00:00",
  //     "create_time": "1399-09-10T07:44:34.200339+00:00",
  //     "image": "http://138.201.6.240:8001/media/blog_photos/omid4.jpg",
  //     "owner": null
  //   },
  //   {
  //     "id": 5,
  //     "title": "مطلب ۹",
  //     "content":
  //         "در چند سال اخیر فریلنسینگ در ایران همگام با تغییرات جهانی رشد خیلی خوبی داشته و حالا تقریبا در همه‌ی مهارت‌ها فریلنسرهای متخصص داخل کشور داریم. اگر شما کارفرمایی خارج از ایران هستید، یا کارفرمایی خارج از ایران می‌شناسید که به دنبال نیروی متخصص است می‌توانید از طریق پونیشا با فریلنسرهای داخل ایران کار کنید. شما می‌توانید از طریق پی‌پال، واریز به حساب بانکی، یا حتی بیت کوین حساب خود را در پونیشا شارژ کنید و با نیروهای متخصص همکاری داشته باشید.\r\n\r\nمرحله‌ی اول: ثبت درخواست\r\n\r\nاز طریق فرم داخل این صفحه درخواست خود را برای ما ارسال کنید تا در اسرع وقت با شما تماس بگیریم.\r\n\r\nمرحله‌ی دوم: انتقال وجه\r\n\r\nپس از مشخص شدن نوع ارز، روش انتقال و ارزش ریالی انتقال وجه را انجام دهید تا حساب شما در پونیشا شارژ شود.\r\n\r\nمرحله‌ی سوم: ادامه کار با فریلنسر\r\n\r\nپس از شارژ حساب کاربری خود می‌توانید فعالیت خود را در پونیشا ادامه دهید، پروژه و مسابقه ایجاد کنید و از طریق قسمت گفتگو با فریلنسرها در ارتباط  باشید و از بین پیشنهادهای دریافتی برای انجام پروژه‌، با توجه به رزومه، نمونه کار و قیمت، فریلنسر یا فریلنسرهای مورد نظر خود را برای انجام کارانتخاب کنید. \r\n\r\nبا اطمینان با فریلنسرهای داخل ایران کار کنید:\r\n\r\nاز طریق پرداخت امن پونیشا با اطمینان با فریلنسرهای داخل ایران کار کنید، شما تا قبل از تحویل پروژه و اعلام رضایت از نتیجه کار هزینه‌ای به فریلنسر پرداخت نمی‌کنید،‌ بلکه این مبلغ در حساب شما قفل می‌شود تا زمانی که پس از تحویل کار شما این مبلغ را برای فریلنسر آزاد کنید.\r\n\r\nبرای کسب اطلاعات بیشتر و دریافت کد تخفیف به اینستاگرام پونیشا سر بزنید و با ما در ارتباط باشید",
  //     "update_time": "1399-09-10T07:43:39.022750+00:00",
  //     "create_time": "1399-09-10T07:43:39.022775+00:00",
  //     "image": "http://138.201.6.240:8001/media/blog_photos/abroad.jpg",
  //     "owner": null
  //   },
  //   {
  //     "id": 4,
  //     "title": "مطلب ۱۰",
  //     "content":
  //         "اگر تا به الان تجربه‌ی دورکاری و برون سپاری پروژه‌ها را ندارید احتمالا برایتان جای تعجب است که چطور می‌توان از راه دور و بدون حتی جلسه‌ای حضوری پروژه و کاری با موفقیت انجام شود؟ خوب است بدانید که براساس آمارهای پیش بینی شده در چند سال اخیر فقط در آمریکا تا سال ۲۰۲۵ بیشتر از ۶۰ درصد شغل‌ها از طریق دورکاری و فریلنسینگ انجام خواهد شد. این در حالی است که در چند ماه اخیر با توجه به همه گیری بیماری کرونا و لزوم کار کردن از خانه و راه دور تعداد پروژه‌های برون سپاری شده حداقل دو برابر شده است و همچنان با شتاب بیشتری روند صعودی خواهد داشت. در همین راستا در این مدت ۸۹ درصد از کارفرماهایی که مجبور به پیشبرد پروژه از راه دور شده‌اند، ادعا کرده‌اند که زمان انجام پروژه‌ها از طریق تماس تصویری و دورکاری کاهش پیدا کرده است. این آمار تا حد زیادی قابل پیش بینی است اگر بدانید که کارمندان زمان بسیار زیادی را در مسیر رفت و آمد به محل کار هدر می‌دهند و از طرفی همین موضوع باعث خستگی و کاهش بازده کاری آنها می‌شود. همچنین کار کردن از خانه و به دور بودن از استرس‌ها و تنش‌های دنیای بیرون می‌تواند روی روحیه‌ی کارمندان اثر مثبتی داشته باشد.\r\n\r\nاگر به عنوان یک صاحب کسب و کار هنوز به دورکاری به عنوان یک فرصت نگاه نکرده‌اید در ادامه چند پیشنهاد برای نحوه‌ی شروع دورکاری کارمندان و نیروی متخصص شما داریم:\r\n\r\nلیست کارمندان و وظایف آن‌ها را بررسی کنید و ببینید امکان انجام کدام یک از کارها از راه دور وجود ندارد و حتما نیاز به نیرویی در شرکت می‌باشد. سعی کنید در انتخاب سخت‌گیر باشید و فقط بخاطر بایگانی اسناد و مدارک و یا هماهنگی جلسات و تیم‌ها نیروی کاری را به دفتر نکشانید. بعد از اینکه کارمندان را به دو دسته تقسیم کردید، باید به سراغ لیست کارهایی بروید که کارمندان دورکار باید انجام دهند و ابزار لازم برای انجام آن در خانه را برایشان تا حد امکان فراهم کنید. فضای ابری مناسب برای ذخیره‌سازی اسناد و گزارش‌ها و تهیه‌ی اشتراک برای استفاده از ابزارهای ویدئو کنفرانس و… حتی می‌توانید در صورت امکان ترتیبی بدهید که کارمندان سیستم و لپ تاپی که در شرکت با آن کار می‌کنند را در خانه هم استفاده کنند تا دسترسی به سخت افزار مورد نیاز برای انجام کارها نیز داشته باشند.\r\n\r\nدر نهایت باید با کارمندان خود در این مورد صحبت کنید و از آن‌ها بخواهید نظر خود را درباره‌ی دورکاری بیان کنند. حتی می‌توانید برای شروع دورکاری یک ماه آزمایشی را در نظر بگیرید تا بعد تصمیم نهایی را با توجه به بازده و روند موفق انجام کارها در این مدت، اتخاذ کنید.\r\n\r\nپیشنهاد شما برای شروع دورکاری چیست؟",
  //     "update_time": "1399-09-10T07:43:00.357080+00:00",
  //     "create_time": "1399-09-10T07:43:00.357098+00:00",
  //     "image": "http://138.201.6.240:8001/media/blog_photos/remote-work.jpg",
  //     "owner": null
  //   },
  //   {
  //     "id": 3,
  //     "title": "مطلب ۱۱",
  //     "content":
  //         "همه‌ی ما می‌دانیم که فریلنسینگ به تنهایی یک شغل نیست و تنها یک سبک زندگی است. اگر شما هنوز تخصصی ندارید که از آن کسب درآمد کنید می‌توانید از مهارت‌هایی شروع کنید که بیشترین پروژه را دارند و با انجام آن‌ها علاوه بر درآمد انگیزه‌ی بیشتری برای ادامه دادن در فریلنسینگ داشته باشید.\r\n\r\nبرای شروع با آموختن این ۴ مهارت می‌توانید به عنوان یک فریلنسر شروع به کار کنید و از تخصص خود کسب درآمد کنید:\r\n\r\n۱. ترجمه، بالاخره این همه زبان خواندن باید به دردی بخورد\r\n\r\nترجمه هنوز هم یکی از مهارت‌های پرطرفدار در فریلنسینگ است. شما می‌توانید با افزایش دانش خود از زبان فارسی و یک زبان دیگر مانند انگلیسی، عربی، اسپانیایی،‌ ترکی و… در کنار یاد گرفتن تکنیک‌های ترجمه، به عنوان یک فریلنسر از تجرمه متون عمومی و تخصصی کسب درآمد کنید.\r\n\r\n۲. تولید محتوا، پادشاه باشید\r\n\r\nاین روزها محتوا قلب اصلی هر کسب و کار و بیزینسی است. شرکت‌ها و استارتاپ‌ها و حتی خیلی از اینفلوئنسرها محتوای شبکه‌های اجتماعی خود را برون‌سپاری می‌کنند تا یک فریلنسر با دیدگاه خلاق‌تر و بهتری محتوای اختصاصی و مرتبط برایشان تولید کند. پس اگر شما آدم خلاقی باشید و به نوشتن، دنیای هیجان‌انگیز کلمات و خلق محتوا علاقه داشته باشید می‌توانید با انجام پروژه‌های تولید محتوا به عنوان یک فریلنسر درآمد داشته باشید.\r\n\r\n۳. طراحی گرافیک، دنیای رنگ‌ها و اشکال\r\n\r\nتنوع پروژه‌های این مهارت آنقدر زیاد است که اگر به عنوان یک تازه کار هم شروع به کار کنید در مسیر یادگیری و حرفه‌ای شدن با انجام پروژه‌ها می‌توانید از آن درآمد هم کسب کنید. از طراحی لوگو تا طراحی ست اداری، تصویرسازی، طراحی اپلیکیشن و سایت، طراحی بسته بندی و طراحی داخلی و نما فقط چند نمونه از تنوع پروژه‌های مرتبط با این مهارت است. برای شروع می‌توانید یک حوزه را انتخاب کنید تا با انجام پروژه‌ها و کسب تجربه خود را برای یادگیری نرم‌افزارها و مهارت‌های بیشتر آماده کنید.\r\n\r\n۴. ادمین شبکه‌های اجتماعی، کمی چالش\r\n\r\nتقریبا همه‌ی ما چند ساعت از شبانه روز خود را مشغول اسکرول و چک کردن شبکه‌های اجتماعی هستیم. با ترکیبی از سه مهارت قبلی، کمی خلاقیت و خوره‌ی شبکه‌های اجتماعی بودن می‌توانید از همین راه هم به درآمد برسید! \r\n\r\nرمز موفقیت، یادگیری و آنالیز همزمان\r\n\r\nبه عنوان یک فریلنسر شاید بزرگ‌ترین چالش برای شما مدیریت و برنامه ریزی کارهاست. اینکه بدانید یادگیری مهارت‌های بیشتر و به کار گیری آنها در انجام پروژه‌ها ارتباط مستقیمی با افزایش درآمد و موفقیت شما دارد. پس فراموش نکنید در فریلنسینگ یادگیری نقطه پایانی ندارد.\r\n\r\nآزادی فریلنسینگ به شما این امکان را می‌دهد که در حین انجام پروژه‌ها، با یادگیری مهارت‌های جدید درآمد خود را نیز افزایش دهید و با آنالیز کار خود همیشه یک قدم از اشتباهاتتان جلوتر باشید.\r\n\r\nبرای شروع کسب درآمد از فریلنسینگ آماده‌اید؟ به پونیشا سر بزنید",
  //     "update_time": "1399-09-10T07:42:00.218785+00:00",
  //     "create_time": "1399-09-10T07:42:00.218803+00:00",
  //     "image": "http://138.201.6.240:8001/media/blog_photos/4skills-blog.jpg",
  //     "owner": null
  //   },
  //   {
  //     "id": 2,
  //     "title": "مطلب ۱۲",
  //     "content":
  //         "اغلب ما که از شطرنج سر در نمی‌آوریم فکر می‌کنیم بازی حوصله سر بری باشد. اما این روزها مینی سریال The Queen’s Gambit با ارائه‌ی یک داستان جذاب توانسته توجه‌ها را به شطرنج جلب کند. این سریال خیلی زود جزو محبوب‌ترین سریال‌های نتفلیکس شده است. داستان دختری نابغه که در یتیم‌خانه بزرگ می‌شود و تنها علاقه‌اش صفحه شطرنج و مهره‌های سفید و سیاه آن است. از آنجایی که به قهرمانان شطرنج لقب استاد بزرگ می‌دهند و از آنها به عنوان نابغه یاد می‌کنند پس باید دانست که شطرنج بیش از یک بازی است. در پس این صفحه‌ی سیاه و سفید آن، هر خانه و هر مهره‌ دارای ارزش خاص خود است و برنده کسی است که برای مواجهه با بیشترین احتمالات آماده باشد، درست شبیه زندگی هر روزه‌ی ما. اما ما برای موفقیت چطور باید مثل برنده‌ها فکر کنیم؟\r\n\r\nحرکت هدفمند\r\n\r\nبرای هر حرکت در کسب و کار خود هدف و دلیلی موجه داشته باشید. همیشه حواستان به حرکت رقیب و تغییرات بازار باشد و متناسب با هر تغییری برنامه داشته باشید. همیشه به احتمالات بیشتر فکر کنید تا برای تغییرات ناگهانی آماده باشید.\r\n\r\nساماندهی مهره‌ها\r\n\r\nاز منابع و نیروهای خود به بهترین نحو استفاده کنید. سعی کنید نقاط قوت و ضعف کسب و کار خود را بشناسید و برای گسترش و توسعه هیچ وقت عجله نکنید. مهم پیشروی با کمترین خطاست و سریع‌تر رفتن هیچ وقت نباید هدف نهایی باشد.\r\n\r\nحفظ ارزش تمام مهره‌ها\r\n\r\nبا اینکه در شطرنج هر مهره‌ای ارزش خود را دارد اما در روند بازی یک سرباز هم می‌تواند تاثیرگذار باشد و باید برای حرکت آن استراتژی داشت. برای رسیدن به موفقیت از تمام نیروی خود استفاده کنید. مهارت‌ها و نیروی انسانی در تیم شما همه‌ دارای ارزش هستند. سعی کنید از بهترین پتانسل آنها برای پیشبرد اهداف خود استفاده کنید.\r\n\r\nهدایت مهره‌ها\r\n\r\nدر شطرنج برای مات کردن حریف باید تمام مهره‌ها در راستای یک هدف واحد حرکت کنند. در کسب و کار هم شما باید بتوانید اعضای تیم و منابع خود را همراستا با هدف نهایی خود مدیریت کنید. برای این منظور باید نقشه‌ی پیشروی داشته باشید و بدانید هر فرد چه نقشی به عهده خواهد داشت.\r\nمثل برنده‌ها فکر کن\r\n\r\nمجموع همه‌ی حرکت‌ها در شطرنج شما را برنده می‌کند همانطور که برای موفق شدن در کسب و کار و زندگی باید از همان ابتدا برنامه داشت و در مسیر رسیدن به آن تلاش کرد. نمی‌توان گفت بدون استراتژی و برنامه‌ریزی شبانه روز می‌توان به موفقیت رسید. زمانی می‌توانید در مسیر موفقیت قدم بردارید که نقشه‌ی آنرا از قبل ترسیم کرده باشید.\r\n\r\nشکست مقدمه پیروزی\r\n\r\nاز شکست نترسید و هیچ وقت خود را بابت آن سرزنش نکنید. به جای آن برای دوباره شروع کردن خود را آماده کنید چون بازی هنوز ادامه دارد. سعی کنید با فراهم کردن یک فرهنگ سازمانی درست از اعضای تیم خود نیز همین را بخواهید. مساله‌ی مهم ناامید نشدن است. مهم‌ترین ویژگی شطرنج‌بازان موفق خسته نشدن از تلاش دوباره است. از شکست‌ها می‌توان درس‌های بیشتری گرفت تا پیروزی‌ها. پس همیشه سعی کنید کار خود را آنالیز کرده و با افزایش تمرکز روی نقاط قوت و بهبود نقاط ضعف با برنامه‌ریزی بهتر دوباره شروع کنید.\r\n\r\nبرای برونسپاری کارهای خود و عملی کردن پروژه‌هایتان می‌توانید در پونیشا نیروی متخصص پیدا کنید و از طریق ایجاد مسابقه یا پروژه با آنها کار کنید. اگر هم مهارتی دارید می‌توانید به عنوان یک فریلنسر در پونیشا فعالیت کنید و با انجام پروژه‌ها، از مهارت و تخصص خود کسب درآمد داشته باشید. همین امروز به پونیشا سر بزنید. برای اطلاع از اخبار پونیشا و کد تخفیف‌ها می‌توانید پونیشا را در اینستاگرام دنبال کنید",
  //     "update_time": "1399-09-10T07:40:41.327948+00:00",
  //     "create_time": "1399-09-10T07:40:41.327967+00:00",
  //     "image": "http://138.201.6.240:8001/media/blog_photos/chess.jpg",
  //     "owner": null
  //   }
  // ];

  @override
  void initState() {
    super.initState();
    if (widget.postId != null) {
      WidgetsBinding.instance
          .addPostFrameCallback((_) => pushNewScreenWithRouteSettings(
                context,
                settings: null,
                screen: BlogPost(widget.postId),
              ));
    }
  }

  @override
  Widget build(BuildContext context) {
    double _width = MediaQuery.of(context).size.width;
    bool _mobileView = _width < mobileViewMaxWidth ? true : false;
    ThemeData _theme = Theme.of(context);

    return FutureBuilder(
        future: Provider.of<BlogProvider>(context, listen: false).fetchBlog(),
        builder: (ctx, snapShot) {
          if (snapShot.connectionState == ConnectionState.waiting) {
            return CustomIndicator();
          } else {
            if (snapShot.hasError) {
              return CustomErrorWidget();
            } else {
              return Container(
                color: _theme.backgroundColor,
                child: Stack(children: [
                  Container(
                    alignment: Alignment.center,
                    margin: EdgeInsets.only(
                      top: appBarHeight,
                    ),
                    child: SingleChildScrollView(
                      child: Container(
                        margin: EdgeInsets.only(
                          top: pagesTopMargin,
                          bottom: pagesBottomMargin,
                          left: pagesRightAndLeftMargin(_width, _mobileView),
                          right: pagesRightAndLeftMargin(_width, _mobileView),
                        ),
                        child: Consumer<BlogProvider>(
                          builder: (ctx, data, child) => Column(
                            children: [
                              ...((widget._pageIndex + 1) * 5 <
                                          data.blogs.length
                                      ? data.blogs.sublist(
                                              widget._pageIndex * 5,
                                              (widget._pageIndex + 1) * 5)
                                          as List<Map<String, Object>>
                                      : data.blogs.sublist(
                                              widget._pageIndex * 5,
                                              data.blogs.length)
                                          as List<Map<String, Object>>)
                                  .map((item) {
                                return BlogPostElement(
                                  item['id'],
                                  item['title'],
                                  item['image'],
                                  getBlogPostDate(item['create_time']),
                                  getBlogPostTime(item['create_time']),
                                );
                              }).toList(),
                              Container(
                                margin: EdgeInsets.only(top: 20),
                                child: Row(
                                  mainAxisAlignment:
                                      MainAxisAlignment.spaceBetween,
                                  children: [
                                    // InkWell(
                                    //   child: Card(
                                    //     shape: RoundedRectangleBorder(
                                    //       side: BorderSide(
                                    //           color: Colors.black, width: 5),
                                    //       borderRadius:
                                    //           BorderRadius.circular(5),
                                    //     ),
                                    //     color: widget._pageIndex ==
                                    //                 (data.blogs.length / 5)
                                    //                     .round() ||
                                    //             (widget._pageIndex + 1) * 5 ==
                                    //                 data.blogs.length
                                    //         ? _theme.disabledColor
                                    //         : _theme.buttonColor,
                                    //     child: Container(
                                    //       margin: EdgeInsets.all(10),
                                    //       child: Text(
                                    //         'صفحه بعدی',
                                    //         textDirection: TextDirection.rtl,
                                    //         style: TextStyle(
                                    //           fontFamily: mainFontFamily,
                                    //           fontWeight: FontWeight.bold,
                                    //         ),
                                    //       ),
                                    //     ),
                                    // ),
                                    //   onTap: () => {
                                    //     widget._pageIndex ==
                                    //                 (data.blogs.length / 5)
                                    //                     .round() ||
                                    //             (widget._pageIndex + 1) * 5 ==
                                    //                 data.blogs.length
                                    //         ? null
                                    //         : pushNewScreenWithRouteSettings(
                                    //             context,
                                    //             settings: null,
                                    //             screen:
                                    //                 Blog(widget._pageIndex + 1),
                                    //             pageTransitionAnimation:
                                    //                 PageTransitionAnimation
                                    //                     .fade,
                                    //           ),
                                    //   },
                                    // ),
                                    RaisedButton(
                                      onPressed: () => {
                                        widget._pageIndex ==
                                                    (data.blogs.length / 5)
                                                        .round() ||
                                                (widget._pageIndex + 1) * 5 ==
                                                    data.blogs.length
                                            ? null
                                            : pushNewScreenWithRouteSettings(
                                                context,
                                                settings: null,
                                                screen:
                                                    Blog(widget._pageIndex + 1),
                                                pageTransitionAnimation:
                                                    PageTransitionAnimation
                                                        .fade,
                                              ),
                                      },
                                      child: Text(
                                        "صفحه بعد",
                                        textAlign: TextAlign.center,
                                      ),
                                    ),
                                    Text(
                                      'صفحه ' +
                                          (widget._pageIndex + 1).toString(),
                                      style: TextStyle(
                                        fontFamily: mainFontFamily,
                                        fontWeight: FontWeight.bold,
                                      ),
                                    ),
                                    RaisedButton(
                                      onPressed: () => {
                                        widget._pageIndex == 0
                                            ? null
                                            : pushNewScreenWithRouteSettings(
                                                context,
                                                settings: null,
                                                screen:
                                                    Blog(widget._pageIndex - 1),
                                                pageTransitionAnimation:
                                                    PageTransitionAnimation
                                                        .fade,
                                              )
                                      },
                                      child: Text(
                                        "صفحه قبل",
                                        textAlign: TextAlign.center,
                                      ),
                                    )
                                    // InkWell(
                                    //   child: Card(
                                    //     shape: RoundedRectangleBorder(
                                    //       side: BorderSide(
                                    //           color: Colors.black, width: 5),
                                    //       borderRadius:
                                    //           BorderRadius.circular(5),
                                    //     ),
                                    //     color: widget._pageIndex == 0
                                    //         ? _theme.disabledColor
                                    //         : _theme.buttonColor,
                                    //     child: Container(
                                    //         margin: EdgeInsets.all(10),
                                    //         child: Text(
                                    //           'صفحه قبلی',
                                    //           textDirection: TextDirection.rtl,
                                    //           style: TextStyle(
                                    //             fontFamily: mainFontFamily,
                                    //             fontWeight: FontWeight.bold,
                                    //           ),
                                    //         )),
                                    //   ),
                                    //   onTap: () => {
                                    //     widget._pageIndex == 0
                                    //         ? null
                                    //         : pushNewScreenWithRouteSettings(
                                    //             context,
                                    //             settings: null,
                                    //             screen:
                                    //                 Blog(widget._pageIndex - 1),
                                    //             pageTransitionAnimation:
                                    //                 PageTransitionAnimation
                                    //                     .fade,
                                    //           ),
                                    //   },
                                    // ),
                                  ],
                                ),
                              ),
                            ],
                          ),
                        ),
                      ),
                    ),
                  ),
                  NormalAppBar(blogPageTitle, true),
                ]),
              );
            }
          }
        });
  }
}

//TODO: implement share button
